app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        @article.user = User.first
        if @article.save
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "another article"], ["description", "odcidcoienevoinv\r\n"], ["created_at", "2020-01-16 15:38:10.925236"], ["updated_at", "2020-01-16 15:38:10.925236"], ["user_id", 2]]