app/controllers/users_controller.rb

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "itui@example.co.uk"], ["updated_at", "2020-01-16 14:09:40.835017"], ["id", 2]]
---
    def update
        if @user.update(user_params)